///////////////////////////////////////////////////////////////////-=505-Tech=-///
//CAUC拳皇-主控板-数据处理
///////////////////////////////////////////////////////////////////-=505-Tech=-///
//编写：徐天泽
//中国民航大学电子科技创新创业实践基地505创客实验室
///////////////////////////////////////////////////////////////////-=505-Tech=-///
//本程序仅供学习参考，未经许可，不得用于其它任何用途
///////////////////////////////////////////////////////////////////-=505-Tech=-///
#include "data.h"
#include "flash.h"
#include "main.h"
///////////////////////////////////////////////////////////////////-=505-Tech=-///
uint16_t DATA[DATA_LENGTH];
///////////////////////////////////////////////////////////////////-=505-Tech=-///
/********************************************************************************
    功能：	判断程序是不是重新烧录后第一次运行
    参数：	无
    返回：	无
    备注：	无
*********************************************************************************/
uint8_t Judge_Program_FirstRun(void)
{
	if(PROGRAM_REFRESH_FLAG == PROGRAM_REFRESH_PASSWORD)
		return 0;
	else
		return 1;
}
/********************************************************************************
    功能：	加载数据
    参数：	无
    返回：	无
    备注：	从flash中加载数据
*********************************************************************************/
extern uint16_t TH_NOW;
void DATA_Load(void)
{
  STMFLASH_Read(DATA_PAGE,DATA,DATA_LENGTH);
	TH_NOW=IR_ALL_TH;
}
/********************************************************************************
    功能：	储存数据
    参数：	无
    返回：	无
    备注：	将数据存进flash
*********************************************************************************/
void DATA_Save(void)
{
  STMFLASH_Write(DATA_PAGE,DATA,DATA_LENGTH);
}
/********************************************************************************
    功能：	恢复缺省数据
    参数：	无
    返回：	无
    备注：	设置参数为缺省值
*********************************************************************************/
void DATA_Default(void)
{
	IR_FL_TH		=	2200;
	IR_FML_TH		=	1500;
	IR_FMR_TH		=	1500;
	IR_FR_TH		=	2200;
	IR_BL_TH		=	2500;
	IR_BM_TH		=	2500;
	IR_BR_TH		=	2500;
	IR_LF_TH		=	2500;
	IR_LM_TH		=	2500;
	IR_LB_TH		=	2500;
	IR_RF_TH		=	2500;
	IR_RM_TH		=	2500;
	IR_RB_TH		=	2500;
	
	IR_JUDGE_TH		=	2000;
	
	IR_TF_TH		=	1000;
	WAVE_BL_TH		=	3400;
	WAVE_BR_TH		=	3400;
	IR_JUMP_TH		=	DefaultTH;
	GRAY_FL_TH		=	300;
	GRAY_FR_TH		=	300;
	GRAY_BL_TH		=	0;
	GRAY_BR_TH		=	0;
	OS_L_TH			=	DefaultTH;
	OS_R_TH			=	DefaultTH;
	IR_ALL_TH		=	1700;
	TH_NOW			=	IR_ALL_TH;
		
	WaitTimeFM      =	100;
	WaitTimeFL      =	170;
	WaitTimeLF      =	250;
	WaitTimeLM      =	320;
	WaitTimeLB      =	350;
	WaitTimeBL      =	500;
	WaitTimeBM      =	550;
					 
	TurnSpeedFL     =   250;
	TurnSpeedLF     =   250;
	TurnSpeedLM     =   250;
	TurnSpeedLB     =   250;
	TurnSpeedBL     =   250;
	TurnSpeedBM     =   250;
	
	PROGRAM_REFRESH_FLAG = PROGRAM_REFRESH_PASSWORD;
}
///////////////////////////////////////////////////////////////////-=505-Tech=-///
