///////////////////////////////////////////////////////////////////-=505-Tech=-///
//CAUC拳皇-主控板-蓝牙驱动
///////////////////////////////////////////////////////////////////-=505-Tech=-///
//编写：徐天泽
//中国民航大学电子科技创新创业实践基地505创客实验室
///////////////////////////////////////////////////////////////////-=505-Tech=-///
//本程序仅供学习参考，未经许可，不得用于其它任何用途
///////////////////////////////////////////////////////////////////-=505-Tech=-///
#include "bluetooth.h"
/********************************************************************************
  功能：	蓝牙初始化
  参数：	无
  返回：	无
  备注：	初始化后LED默认关闭
*********************************************************************************/
void BLUETOOTH_Init()
{
  GPIO_InitTypeDef  GPIO_InitStructure;										//建立初始化结构体
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
                                                          //打开GPIO时钟
  GPIO_StructInit(&GPIO_InitStructure);                   //为初始化结构体赋缺省值
  GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_Out_PP;       //设置IO模式为推挽输出
  GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_12;
  GPIO_Init(GPIOC, &GPIO_InitStructure);							    //读取初始化结构体的值
  
	
	BLUETOOTH_EN = BLUETOOTH_ON;
}
///////////////////////////////////////////////////////////////////-=505-Tech=-///
